app/controllers/scores_controller.rb

SELECT "scores".* FROM "scores"
---
  def index
    $b = "0"
    $m = ""
    @scores = Score.all

INSERT INTO "scores" ("subject", "point", "grade", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["subject", "Q"], ["point", 50], ["grade", "F"], ["student_id", 1], ["created_at", "2022-10-08 17:52:19.268348"], ["updated_at", "2022-10-08 17:52:19.268348"]]
---
  def create
    @score = Score.new(score_params)

    respond_to do |format|
      if @score.save

UPDATE "scores" SET "point" = ?, "updated_at" = ? WHERE "scores"."id" = ?  [["point", 60], ["updated_at", "2022-10-08 17:52:35.395257"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @score.update(score_params)

DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 8]]
---
  def destroy
    @score.destroy