app/controllers/st_score_controller.rb

  def home
    @student = nil
    Student.all.each do |std|
---
SELECT "students".* FROM "students"

  def delete
    Score.destroy_by(id: params[:id])
---
DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 7]]

  def update
    @id = params[:id]
    @sc = Score.all.find(@id)
    @sc.subject = params[:subject]
    @sc.point = params[:point]
    @sc.grade = params[:grade]
    @sc.save
---
SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "scores" SET "subject" = ?, "updated_at" = ? WHERE "scores"."id" = ?  [["subject", "C"], ["updated_at", "2022-09-29 08:55:11.350166"], ["id", 5]]

  def success
    @x = Score.new
    @x.subject = params[:subject]
    @x.point = params[:point].to_i
    @x.grade = params[:grade]
    @x.student_id = params[:id]
    @x.save
---
INSERT INTO "scores" ("subject", "point", "grade", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["subject", "C"], ["point", 50], ["grade", "D"], ["student_id", 1], ["created_at", "2022-09-29 09:13:47.376536"], ["updated_at", "2022-09-29 09:13:47.376536"]]